# 5. ** Реализовать функцию, возвращающую n шуток, сформированных из трех случайных слов, 
# взятых из трёх списков (по одному из каждого)
# nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
# adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью", "когда-то", "где-то"]
# adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]

# in
# 10 True

# out
# ['дом ночью мягкий', 'огонь завтра зеленый', 'лес вчера яркий', 
# 'автомобиль сегодня веселый', 'город позавчера утопичный']

# in
# 10 False

# out
# ['автомобиль ночью мягкий', 'огонь вчера веселый', 'автомобиль позавчера веселый', 
# 'город вчера утопичный', 'лес сегодня зеленый', 'дом вчера яркий', 'автомобиль вчера зеленый', 
# 'огонь позавчера яркий', 'огонь где-то утопичный', 'автомобиль где-то мягкий']

from random import choice, shuffle

ls1 = ["автомобиль", "лес", "огонь", "город", "дом"]
ls2 = ["сегодня", "вчера", "завтра", "позавчера", "ночью", "когда-то", "где-то"]
ls3 = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]

def bazinga (num, param = False):
    new_lst = []
    for i in range(num):
        fst = choice(ls1)
        scd = choice(ls2)
        thd = choice(ls3)
        new_lst.append(f'{fst} {scd} {thd}')

        if param == True:
            shuffle(ls1)
            shuffle(ls2)
            shuffle(ls3)
            new_lst = list(zip(ls1, ls2, ls3)) # доделать!
            
    return new_lst    

print(bazinga(10, True))