# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, 
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся 
# с соответствующей буквы.

# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 
# 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

lst = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алиса", "Алина", "Алена", "Бибочка"]

def create_dict(lst: list):
    dictionary = {}
    lst.sort()
    for word in lst:
        dictionary[word[0]] = dictionary.setdefault(word[0], [])
        dictionary[word[0]].append(word)
    return dict(sorted(dictionary.items()))
    
result = create_dict(lst)
print(result)

